
# State **`s3://infrahouse-website-infra/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        3 |           1 |          0 |
## Affected resources by action

|  Action  | Resources                                                |
|:--------:|:---------------------------------------------------------|
|    🟢    | `module.cdn-staging.aws_cloudfront_cache_policy.default` |
|    🟢    | `module.cdn-staging.aws_cloudfront_distribution.repo`    |
|    🟢    | `module.cdn-staging.aws_route53_record.repo`             |
|    🟡    | `module.cdn.aws_cloudfront_cache_policy.default`         |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cdn.aws_cloudfront_cache_policy.default will be updated in-place
  ~ resource "aws_cloudfront_cache_policy" "default" {
        id          = "ea742fff-3eb3-4437-bfce-2ef431afcfcc"
      ~ name        = "ih-backend_default" -> "ih-backend_cdn"
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cdn-staging.aws_cloudfront_cache_policy.default will be created
  + resource "aws_cloudfront_cache_policy" "default" {
      + default_ttl = 300
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 600
      + min_ttl     = 60
      + name        = "ih-backend_cdn-staging"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + enable_accept_encoding_brotli = true
          + enable_accept_encoding_gzip   = true

          + cookies_config {
              + cookie_behavior = "none"
            }

          + headers_config {
              + header_behavior = "none"
            }

          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # module.cdn-staging.aws_cloudfront_distribution.repo will be created
  + resource "aws_cloudfront_distribution" "repo" {
      + aliases                         = [
          + "cdn-staging.infrahouse.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = {
          + "created_by"  = "infrahouse/infrahouse-website-infra"
          + "environment" = "production"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id        = (known after apply)
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "ih-backend"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "https-only"
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "infrahouse.com"
          + origin_id                = "ih-backend"
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = [
                  + "CN",
                  + "IR",
                  + "RU",
                ]
              + restriction_type = "blacklist"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:493370826424:certificate/9b098d66-e990-4b43-b645-0294ac12a0a6"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.cdn-staging.aws_route53_record.repo will be created
  + resource "aws_route53_record" "repo" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "cdn-staging.infrahouse.com"
      + type            = "A"
      + zone_id         = "Z07662251LH3YRF2ERM3G"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS90ZXJyYWZvcm0udGZzdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJhZGQiOiAzLCAiY2hhbmdlIjogMSwgImRlc3Ryb3kiOiAwfX0=
```
</details>